# EndLocalParameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolylineSegments..::..EndLocalParameter Property
PolylineSegments Class See Also
---
Local parameter associated with the end point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double EndLocalParameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndLocalParameter As Double
	Get
```

Visual C++
---
```text
public:
property double EndLocalParameter {
	double get ();
}
```

# See Also
PolylineSegments Class
Autodesk.Revit.DB Namespace